In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

# from IPython.display import Image

### Hierarchical Indexes on DataFrames and Series

In [3]:
# np.random.seed(12345)
# pd.options.display.max_rows = 20
# plt.rc('figure', figsize=(10, 6))

### Hierarchical Indexing
- Hierarchical indexing allows you to have multiple index levels 
- Despite the name (indexing), it applies to both indexes and columns (i.e., rows or columns)
- Each index in a `MutiIndex` Object is referred to as a level

In [4]:
prog_languages = pd.DataFrame({ "Course":["Python", "Rust", "Python", "Rust"], 
              "Nb_participants": [10, 30, 27, 18]})
prog_languages.groupby("Course").sum()

        Nb_participants
Course
Python               37
Rust                 48

In [5]:
data = pd.Series(np.random.randn(9),
                 index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],
                        [1, 2, 3, 1, 3, 1, 2, 2, 3]])
data

a  1    0.652026
   2    0.416403
   3   -1.321372
b  1    0.170869
   3    1.995539
c  1    0.416681
   2   -2.113430
d  2   -0.608712
   3   -1.139065
dtype: float64

In [34]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [38]:
data[('b', 1)]

0.0221845986581725

In [39]:
data['b', 1]

0.0221845986581725

In [40]:
data['b':'c']

b  1    0.022185
   3    0.758363
c  1   -0.660524
   2    0.862580
dtype: float64

In [41]:
data.loc[['b', 'd']]

b  1    0.022185
   3    0.758363
d  2   -0.010032
   3    0.050009
dtype: float64

In [6]:
data

a  1    0.652026
   2    0.416403
   3   -1.321372
b  1    0.170869
   3    1.995539
c  1    0.416681
   2   -2.113430
d  2   -0.608712
   3   -1.139065
dtype: float64

In [46]:
data.loc[: , 2]

a   -0.919262
c    0.862580
d   -0.010032
dtype: float64

In [10]:
df = pd.DataFrame({"A": np.random.randn(9), "B":np.random.randn(9)}, 
                  index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'], [1, 2, 3, 1, 3, 1, 2, 2, 3]])

In [11]:
df

            A         B
a 1 -0.302615  2.254200
  2  0.928870 -0.489333
  3  1.174332 -0.526831
b 1 -0.079962 -0.640435
  3 -0.776820 -0.764759
c 1 -0.785120 -0.440576
  2  2.179205 -0.802068
d 2  0.338863  1.397092
  3 -0.111865  1.197859

In [42]:
pd.IndexSlice?

In [45]:
#E.g., data.loc[: , 2] worked on a Series but does not work on a DataFrame

df.loc(axis=0)[pd.IndexSlice[:, 2]]

            A         B
a 2  0.928870 -0.489333
c 2  2.179205 -0.802068
d 2  0.338863  1.397092

### Stacked vs. Unstacked Data

* Hierarchical indexes represent how the data is often collected
 * Ex. if variables in a hospital are measured and recorded in different files

```python
    File 1
    patient_ABC LDL 112
    patient_ABC HDL 48
    patient_CCX  LDL 112
    patient_VDM  LDL 112
    patient_ABC  VO2 112
    patient_CCZ  RER 48
    ...
```


* This format is preferred  when not all the variables are measured in all the patients

  * I.e., using columns for the variables would result in a large number of empty cells

### Stacking and unstacking a DataFrame

* You can convert back and forth between a data frame and a hierarchical index with `stack()` and `unstack()`

![](https://www.dropbox.com/s/2u5lk89ga6mkcob/stacking_DF.png?dl=1)

In [52]:
x

          1         2         3
a  0.652026  0.416403 -1.321372
b  0.170869       NaN  1.995539
c  0.416681 -2.113430       NaN
d       NaN -0.608712 -1.139065

In [53]:
x  = x.stack()
x

a  1    0.652026
   2    0.416403
   3   -1.321372
b  1    0.170869
   3    1.995539
c  1    0.416681
   2   -2.113430
d  2   -0.608712
   3   -1.139065
dtype: float64

In [51]:
x = data.unstack()
x

          1         2         3
a  0.652026  0.416403 -1.321372
b  0.170869       NaN  1.995539
c  0.416681 -2.113430       NaN
d       NaN -0.608712 -1.139065

### Hierarchical indexes on rows and columns


* In a `DataFrame`, both axes can have a hierarchical index.
* Alway remember the labels are stored under `index` in rows and `columns` for the columns

![](https://www.dropbox.com/s/9knv5i5n63nw7l0/index_columns.png?dl=1)

In [55]:
data = pd.DataFrame(np.arange(12).reshape((4, 3)),
                     index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                     columns=[['Ohio', 'Ohio', 'Colorado'],
                              ['Green', 'Red', 'Green']])
data

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [56]:
data.index.names = ['key1', 'key2']
data.columns.names = ['state', 'color']
data

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [57]:
print(data.index.get_level_values("key1"))
data.index.get_level_values("key2")

Index(['a', 'a', 'b', 'b'], dtype='object', name='key1')

Int64Index([1, 2, 1, 2], dtype='int64', name='key2')

In [59]:
print(data.columns.get_level_values("state"))
data.columns.get_level_values("color")

Index(['Ohio', 'Ohio', 'Colorado'], dtype='object', name='state')

Index(['Green', 'Red', 'Green'], dtype='object', name='color')

In [76]:
data['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [77]:
data['Ohio', 'Green']

key1  key2
a     1       0
      2       3
b     1       6
      2       9
Name: (Ohio, Green), dtype: int64

### Creating and assigning a `MultiIndex` Object

* You can create a `MultiIndex` using one of the constructors
  * Ex. create form arrays
* As long as the dimensions are compatible, you can assign the `MultiIndex` to either the `index` or `column` attribute of a `DataFrame` or a `Series`

In [78]:
data = pd.DataFrame(np.arange(12).reshape((4, 3)),
                     index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]])
data.index.names = ["letter", "number"]
data

               0   1   2
letter number
a      1       0   1   2
       2       3   4   5
b      1       6   7   8
       2       9  10  11

In [26]:
pd.MultiIndex.from_arrays([['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']],
                       names=['state', 'color'])

MultiIndex(levels=[['Colorado', 'Ohio'], ['Green', 'Red']],
           labels=[[1, 1, 0], [0, 1, 0]],
           names=['state', 'color'])

In [90]:
data.columns = pd.MultiIndex.from_arrays([['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']],
                       names=['state', 'color'])
data

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

### Reordering and Sorting Levels
- Swap levels takes two levels `numbers` or `names` and returns a new object with the levels interchanged
- And as with simple indexes, you can sort a single or a combination of indexes of the `MultiIndex` object

In [81]:
data.index.names = ['key1', 'key2']
data

           0   1   2
key1 key2
a    1     0   1   2
     2     3   4   5
b    1     6   7   8
     2     9  10  11

In [82]:
data.swaplevel('key1', 'key2')

           0   1   2
key2 key1
1    a     0   1   2
2    a     3   4   5
1    b     6   7   8
2    b     9  10  11

In [83]:
# You can also pass the level's index, instead of name
data.sort_index(level=1, ascending=False)

           0   1   2
key1 key2
b    2     9  10  11
a    2     3   4   5
b    1     6   7   8
a    1     0   1   2

In [89]:
data.swaplevel(0, 1).sort_index(level=0, ascending=False)

           0   1   2
key2 key1
2    b     9  10  11
     a     3   4   5
1    b     6   7   8
     a     0   1   2

In [96]:
data.swaplevel(0, 1, 0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [98]:
data.swaplevel(0, 1, 1)

color     Green  Red    Green
state      Ohio Ohio Colorado
key1 key2
a    1        0    1        2
     2        3    4        5
b    1        6    7        8
     2        9   10       11

In [99]:
data.swaplevel('state', 'color', axis=1)

color     Green  Red    Green
state      Ohio Ohio Colorado
key1 key2
a    1        0    1        2
     2        3    4        5
b    1        6    7        8
     2        9   10       11

### Summary Statistics by Level

* The summary statistics that we've seen before can also be applied by level
* When you apply a function on the level, the remaining levels get `"squashed"`
* While you will see such code, this approach is no longer recommended and won't be supported in future versions
  * Use `groupby` instead

In [102]:
data

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [104]:
data.sum(level="state", axis=1)

/var/folders/6m/188vj34d6nv8qsnxqt6plydw0000gn/T/ipykernel_78605/1335975597.py:1: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.sum(level=1) should use df.groupby(level=1).sum().
  data.sum(level="state", axis=1)

state      Ohio  Colorado
key1 key2
a    1        1         2
     2        7         5
b    1       13         8
     2       19        11

### Setting and Resetting and Index
* It' common to read in a data frame file and use one of its columns as an index
  * Setting a column as an index is done using `set_index()`
    * By default, the columns are removed from the `DataFrame`, but you can choose to leave them in 

  * `reset_index()` does the opposite; moves the index as a new column of the `DataFrame`
    * Creates a new index from an `IndexRange()`

In [78]:
data = pd.DataFrame({'a': range(7), 'b': range(7, 0, -1),
                      'c': ['one', 'one', 'one', 'two', 'two',
                            'two', 'two'],
                      'd': [0, 1, 2, 0, 1, 2, 3]})
data

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [80]:
data2 = data.set_index('b')
data2

   a    c  d
b
7  0  one  0
6  1  one  1
5  2  one  2
4  3  two  0
3  4  two  1
2  5  two  2
1  6  two  3

In [82]:
data3 = data.set_index(['c', 'd'])
data3

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [83]:
data.set_index(['c', 'd'], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [84]:
data4 = data2.reset_index()
data4

   b  a    c  d
0  7  0  one  0
1  6  1  one  1
2  5  2  one  2
3  4  3  two  0
4  3  4  two  1
5  2  5  two  2
6  1  6  two  3

In [44]:
frame4.index

RangeIndex(start=0, stop=7, step=1)